{
    "1": {
        "id ": "1",
        "title": "\"Malaysia My Second Home\" (MM2H) program",
        "description": "The program aims to attract individuals from around the world to retire, invest, or settle down in Malaysia. Participants in the MM2H program enjoy various benefits and incentives, including the opportunity to purchase property, access to quality healthcare, and a favorable tax environment. The MM2H program has contributed to Malaysia's economy by attracting foreign investment and promoting tourism.",
        "link": "https://www.asiapropertyawards.com/en/investment-oasis-revised-mm2h-programme-positions-malaysia-as-a-second-home-paradise/"
    },
    "2": {
        "id ": "2",
        "title": "Only 2 applications have been approved for the Premium Visa Program.",
        "description": "The Premium Visa Program may be a visa program targeted towards a specific group or with special requirements. The fact that only two applications have been approved suggests that there may be a lower number of applicants for this program or that the approval criteria are more stringent, resulting in only a few applicants meeting the requirements.",
        "link": "https://www.thestar.com.my/news/nation/2023/12/21/one-stop-mm2h-hub-opens-at-motac-in-putrajaya"
    },
    "3": {
        "id": "3",
        "title": "AIRASIA HAS ADDED THREE NEW ROUTES TO SOUTHERN CITIES IN CHINA.",
        "description": "This initiative will further enhance the air connectivity between Malaysia and southern cities in China, providing passengers with more convenience and options. The introduction of these new routes will facilitate increased tourism, business activities, and people-to-people exchanges, strengthening the communication and cooperation between the two countries. The addition of these three routes by AirAsia will bolster the air links between Malaysia and southern cities in China and offer passengers a greater selection of flight choices.",
        "link": "https://www.freemalaysiatoday.com/category/business/2023/05/15/airasia-adds-three-routes-to-southern-china-cities/"
    },
    "4": {
        "id": "4",
        "title": "SARAWAK - MALAYSIA MY SECOND HOME PROGRAM (S-MM2H) [1]",
        "description": "The \"Sarawak - Malaysia My Second Home Program\" (S-MM2H) is a program that allows foreigners to live in Sarawak, a state in Malaysia, on a long-term basis. The Malaysia My Second Home (MM2H) program is a government initiative that was extended to Sarawak to promote the state as an attractive destination for foreigners to retire, invest, or settle down.",
        "link": "https://sarawak.sinchew.com.my/20230527/52678400/"
    },
    "5": {
        "id": "5",
        "title": "SARAWAK - MALAYSIA MY SECOND HOME PROGRAM (S-MM2H) [2]",
        "description": "The \"Sarawak - Malaysia My Second Home Program\" (S-MM2H) is a program that allows foreigners to live in Sarawak, a state in Malaysia, on a long-term basis. The Malaysia My Second Home (MM2H) program is a government initiative that was extended to Sarawak to promote the state as an attractive destination for foreigners to retire, invest, or settle down.",
        "link": "https://sarawak.sinchew.com.my/20230528/52897840/"
    },
    "6": {
        "id": "6",
        "title": "SARAWAK - MALAYSIA MY SECOND HOME PROGRAM (S-MM2H) [3]",
        "description": "The \"Sarawak - Malaysia My Second Home Program\" (S-MM2H) is a program that allows foreigners to live in Sarawak, a state in Malaysia, on a long-term basis. The Malaysia My Second Home (MM2H) program is a government initiative that was extended to Sarawak to promote the state as an attractive destination for foreigners to retire, invest, or settle down.",
        "link": "https://sarawak.sinchew.com.my/20230529/52914541/"
    },
    "7": {
        "id": "7",
        "title": "REIGNITING MM2H",
        "description": "\"Reigniting MM2H\" refers to efforts to revive and stimulate interest in the Malaysia My Second Home (MM2H) program.",
        "link": "https://www.thestar.com.my/business/business-news/2023/04/15/reigniting-mm2h"
    },
    "8": {
        "id": "8",
        "title": "ONLINE APPLICATION FOR SARAWAK - MALAYSIA MY SECOND HOME (MM2H) PROGRAM",
        "description": "The implementation of online applications for the Sarawak - Malaysia My Second Home (MM2H) Program offers a convenient and expedient way for foreigners to apply. It simplifies the application process and allows for faster submission and processing. Applicants can track their application status and receive updates electronically. Overall, it enhances accessibility and convenience for individuals interested in settling in Sarawak.",
        "link": "https://www.theborneopost.com/2023/06/01/application-for-swak-msia-my-second-home-programme-now-available-online-says-deputy-minister/"
    },
    "9": {
        "id": "9",
        "title": "PROMOTE ECONOMIC DEVELOPMENT BY URGING THE MINISTRY OF HOME AFFAIRS TO RELAX MM2H APPLICATION REQUIREMENTS, SAYS PENANG LAWMAKER",
        "description": "A Penang lawmaker is urging the Ministry of Home Affairs to loosen the application criteria for the Malaysia My Second Home (MM2H) program in order to stimulate economic development. The lawmaker highlights the importance of attracting foreign residents and investors to contribute to the country's economy. By advocating for a more flexible and accessible MM2H program, the aim is to enhance economic growth and opportunities.",
        "link": "https://www.themalaysianinsight.com/chinese/s/438442"
    },
    "10": {
        "id": "10",
        "title": "AWARD-WINNING VIDEO \"AMAZING\"",
        "description": "this 'AMAZING' video was awarded the Special Award “MAGIC EYE” for Best Camerawork and 2021 Tourism & Travel Media intermedia-globe Gold Award at the 21st WorldMediaFestivals, Hamburg, Germany.",
        "link": "https://youtu.be/AoXYmfBurUM"
    },
    "11": {
        "id": "11",
        "title": "ONLY 2 OUT OF 28 APPLICANTS APPROVED FOR PREMIUM VISA PROGRAM, SAYS SAIFUDDIN",
        "description": "The Premium Visa Program is a high-quality visa program aimed at attracting foreign talent and investors to Malaysia. The low approval rate highlights the stringent criteria and rigorous evaluation process for the program. The government's focus remains on selecting qualified and suitable individuals who can contribute to the country's economic growth and development.",
        "link": "https://www.orientaldaily.com.my/news/nation/2023/05/24/568429"
    },
    "12": {
        "id": "12",
        "title": "GOVT TO DIVIDE MM2H PROGRAMME UNDER THREE CATEGORIES",
        "description": "Minister Datuk Seri Tiong King Sing said : To provide the foreigner a choice, I recommended three categories: Platinum, Gold, and Silver - will demand a different amount of the permanent applicants' savings.",
        "link": "https://www.thestar.com.my/news/nation/2023/06/22/govt-to-divide-mm2h-programme-under-three-categories"
    },
    "13": {
        "id": "13",
        "title": "CHEN CHI HSIUNG PROPOSES RESTRUCTURING MM2H PROGRAM TO ATTRACT FOREIGNERS AMIDST WEAK MALAYSIAN RINGGIT",
        "description": "Chen Chi Hsiung proposes restructuring MM2H program to attract more foreigners amidst weak Ringgit, aiming to boost economy and tourism.",
        "link": "https://www.themalaysianinsight.com/chinese/s/445744"
    },
    "14": {
        "id": "14",
        "title": "\"THE SECOND HOMELAND (PART 1) | CULTURE, HOSPITALITY, CUISINE, EDUCATION... HEARING CHINESE PEOPLE PRAISE THE COMFORT OF MALAYSIA.\"",
        "description": "Lao Luo : Malaysia is a country that makes him feel safe and secure. Malaysia is a multicultural nation where diverse ethnicities, languages, cultures, and religions coexist, which is deeply appealing to him and a significant reason for him to settle in Malaysia.",
        "link": "https://vip.sinchew.com.my/%e7%ac%ac%e4%ba%8c%e5%ae%b6%e5%9b%ad%ef%bc%88%e4%b8%8a%ef%bc%89-%e6%96%87%e5%8c%96%e3%80%81%e4%ba%ba%e6%83%85%e3%80%81%e7%be%8e%e9%a3%9f%e3%80%81%e6%95%99%e8%82%b2%e5%90%ac%e4%b8%ad/"
    },
    "15": {
        "id": "15",
        "title": "THE SECOND HOMELAND (PART 2) | CULTURE, HOSPITALITY, CUISINE, EDUCATION... HEARING CHINESE PEOPLE PRAISE THE COMFORT OF MALAYSIA.",
        "description": "During the interview, Cui Yang pointed out that considering the busy lifestyle and severe pollution in major cities in China, he hopes his children can grow up in a healthy and pleasant climate. That's why he chose to relocate to Malaysia.",
        "link": "https://vip.sinchew.com.my/%e7%ac%ac%e4%ba%8c%e5%ae%b6%e5%9b%ad%ef%bc%88%e4%b8%ad%ef%bc%89-%e4%b8%ba%e5%ad%a9%e5%ad%90%e4%b8%be%e5%ae%b6%e7%a7%bb%e5%b1%855%e5%b9%b4-%e4%b8%ad%e5%a4%ab%e5%a6%87%e8%9e%8d%e5%85%a5%e6%96%b0/"
    },
    "16": {
        "id": "16",
        "title": "\"MM2H TO SEE POSITIVE CHANGES\"",
        "description": "PETALING JAYA: Positive changes are coming soon for the revision of the Malaysia My Second Home (MM2H) programme, says Datuk Seri Tiong King Sing (pic). “It will be announced in mid-December after a thorough review,” said the Tourism, Arts and Culture Minister.",
        "link": "https://www.thestar.com.my/news/nation/2023/12/04/mm2h-to-see-positive-changes"
    },
    "17": {
        "id": "17",
        "title": "\"SARAWAK BECOMING PREFFERED DESTINATION FOR MM2H PROGRAMME: JUWAI IQI CO-FOUNDER\"",
        "description": "KUALA LUMPUR: Sarawak is becoming the preferred destination for the Malaysia My Second Home (MM2H) programme with an almost 25 fold increase in total approved MM2H applications this year, compared with 27 in 2021. According to Kashif Ansari, co-founder and group chief executive officer of Juwai IQI, local authorities in Sarawak had approved 406 applications as of July of this year.",
        "link": "https://www.nst.com.my/business/corporate/2023/11/978841/sarawak-becoming-preffered-destination-mm2h-programme-juwai-iqi-co"
    },
    "18": {
        "id": "18",
        "title": "\"张庆信：展望建交50周年良机　启航马中旅游黄金时代\"",
        "description": "（吉隆坡13日讯）旅游、艺术及文化部长拿督斯里张庆信近日率领马来西亚代表团于12月8日至20日期间，到中国的重点城市展开2023年度的第三次马来西亚旅游促销与路演任务。 此行目标放眼充分发挥紧接而来的2024马中建交50周年、2026大马观光年的“天赐良机”，以及30天免签入 境 措施的“政策优势”，为我国旅游领域创造友善环境、灌溉经济增长的沃土，同时筑造大马第二家园计划（MM2H）顺畅重启的桥梁",
        "link": "https://www.orientaldaily.com.my/news/nation/2023/12/13/617594"
    },
    "19": {
        "id": "19",
        "title": "\"ABD KARIM: S-MM2H PROGRAMME WILL BE FURTHER PROMOTED TO FOREIGNERS FROM FOUR-SEASON COUNTRIES\"",
        "description": "KUCHING (Dec 13): Sarawak Minister of Tourism, Creative Industry, and Performing Arts Dato Sri Abdul Karim Rahman Hamzah said the Sarawak-Malaysia My Second Home (S-MM2H) programme will be further promoted to foreigners who live in countries with four seasons.",
        "link": "https://www.theborneopost.com/2023/12/13/abd-karim-s-mm2h-programme-will-be-further-promoted-to-foreigners-from-four-season-countries/"
    },
    "20": {
        "id": "20",
        "title": "\"张庆信率团访华 第三度促销大马\"",
        "description": "（北京13日讯）旅游、艺术及文化部长拿督斯里张庆信近日率团前往中国重点城市，开展2023年度第三次大马旅游促销与路演任务，放眼为我国旅游领域创造友善环境、灌溉经济增长的沃土，同时筑造“马来西亚，我的第二家园”计划（MM2H）顺畅重启的桥梁。",
        "link": "https://www.chinapress.com.my/?p=3726220"
    },
    "21" : {
        "id": "21",
        "title": "\"ONE-STOP MM2H HUB OPENS AT MOTAC IN PUTRAJAYA\"",
        "description": "PUTRAJAYA: The one-stop My Malaysia Second Home (MM2H) service counter has started operations at the Tourism, Arts and Culture Ministry (Motac) here. The opening of the counter at Level 1 at the ministry building follows the closure of another service centre at the Immigration Department on Dec 15.",
        "link" : "https://www.thestar.com.my/news/nation/2023/12/21/one-stop-mm2h-hub-opens-at-motac-in-putrajaya"
    },
    "22" : {
        "id" : "22",
        "title" : "ONE-STOP MM2H SERVICE CENTRE OPENS AT TOURISM MINISTRY",
        "description" : "PUTRAJAYA, Dec 18 — The one-stop My Malaysia Second Home (MM2H) service counter has started operations at the Tourism, Arts and Culture Ministry (MOTAC) here today. MOTAC said that the opening of the counter at Level 1 of the ministry building follows the closure of another service centre at the Immigration Department on Dec 15.",
        "link" : "https://www.malaymail.com/news/malaysia/2023/12/18/one-stop-mm2h-service-centre-opens-at-tourism-ministry/108163"
    }
}